In [2]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt
from IPython.display import clear_output
from sqlalchemy import create_engine
%matplotlib inline

In [3]:
engine = create_engine("mysql+mysqlconnector://root:cinta1malam@localhost/ujiantitanic?host=localhost?port=3306")
conn = engine.connect()

In [23]:
def panggil(k):
    q = f'''SELECT * FROM {k}'''
    results = conn.execute(q).fetchall()
    df1 = pd.DataFrame(results)
    df1.columns = results[0].keys()
#     df1.set_index('id', inplace=True)
    return df1

In [24]:
p = """
SELECT TABLE_NAME 
FROM INFORMATION_SCHEMA.TABLES
WHERE TABLE_TYPE = 'BASE TABLE' AND TABLE_SCHEMA='dbName'
"""

In [26]:
df = panggil('titanicoutcalc')
df

   id  mean_fare   std_fare  batas_min_fare  batas_max_fare
0   1  13.675550  11.778142      -21.658875       49.009975
1   2  84.154687  78.380373     -150.986430      319.295805
2   3  20.662183  13.417399      -19.590013       60.914379

In [38]:
df

Empty DataFrame
Columns: []
Index: []